In [1]:
import pandas as pd
import numpy as np

## Import three dataset

In [19]:
pd.options.display.max_rows = 10

In [16]:
mnames = ['movie_id','title','genres']
df_movie = pd.read_table(r"C:\Users\Connie Wu\Python\pydata-book-2nd-edition\datasets\movielens\movies.dat",sep="::",header=None,names = mnames)
df_movie.head()

<ipython-input-16-d7d4064b1c50>:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df_movie = pd.read_table(r"C:\Users\Connie Wu\Python\pydata-book-2nd-edition\datasets\movielens\movies.dat",sep="::",header=None,names = mnames)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [17]:
df_movie.shape

(3883, 3)

In [14]:
rnames = ['user_id','movie_id','rating','timestamp']
df_rating = pd.read_table(r"C:\Users\Connie Wu\Python\pydata-book-2nd-edition\datasets\movielens\ratings.dat",sep = "::",header= None, names = rnames)
df_rating.head()

<ipython-input-14-16281d6a9abc>:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df_rating = pd.read_table(r"C:\Users\Connie Wu\Python\pydata-book-2nd-edition\datasets\movielens\ratings.dat",sep = "::",header= None, names = rnames)

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [15]:
df_rating.shape

(1000209, 4)

In [12]:
unames = ['user_id','gender','age','accupation','zip']
df_user = pd.read_table(r"C:\Users\Connie Wu\Python\pydata-book-2nd-edition\datasets\movielens\users.dat",sep="::", header=None, names =unames)
df_user.head()

<ipython-input-12-64346b789b9c>:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df_user = pd.read_table(r"C:\Users\Connie Wu\Python\pydata-book-2nd-edition\datasets\movielens\users.dat",sep="::", header=None, names =unames)

   user_id gender  age  accupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [13]:
df_user.shape

(6040, 5)